# Pandas Exercises

Time to test your new pandas skills! Use the two csv files in this folder to complete the tasks in bold below!

** NOTE: ALL TASKS MUST BE DONE IN ONE LINE OF PANDAS CODE. GOT STUCK? NO PROBLEM! CHECK OUT THE SOLUTIONS LECTURE! **

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('banklist.csv')

** Show the head of the dataframe **

In [6]:
# CODE HERE
df.head

<bound method NDFrame.head of                                              Bank Name                City  \
0                                  Fayette County Bank          Saint Elmo
1    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
2                                       First NBC Bank         New Orleans
3                                        Proficio Bank  Cottonwood Heights
4                        Seaway Bank and Trust Company             Chicago
..                                                 ...                 ...
546                                 Superior Bank, FSB            Hinsdale
547                                Malta National Bank               Malta
548                    First Alliance Bank & Trust Co.          Manchester
549                  National State Bank of Metropolis          Metropolis
550                                   Bank of Honolulu            Honolulu

     ST   CERT                Acquiring Institution Closing Date Updated Date
0    IL   1802            United Fidelity Bank, fsb    26-May-17     1-Jun-17
1    WI  30003  First-Citizens Bank & Trust Company     5-May-17     1-Jun-17
2    LA  58302                         Whitney Bank    28-Apr-17    23-May-17
3    UT  35495                    Cache Valley Bank     3-Mar-17    18-May-17
4    IL  19328                  State Bank of Texas    27-Jan-17    18-May-17
..   ..    ...                                  ...          ...          ...
546  IL  32646                Superior Federal, FSB    27-Jul-01    19-Aug-14
547  OH   6629                    North Valley Bank     3-May-01    18-Nov-02
548  NH  34264  Southern New Hampshire Bank & Trust     2-Feb-01    18-Feb-03
549  IL   3815              Banterra Bank of Marion    14-Dec-00    17-Mar-05
550  HI  21029                   Bank of the Orient    13-Oct-00    17-Mar-05

[551 rows x 7 columns]>

In [8]:
df.index.names

FrozenList([None])

In [9]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [ ]:
# CODE HERE

In [21]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [10]:
# CODE HERE

In [28]:
len(df['ST'].unique())

44

In [27]:
df['ST'].count()

551

44

** Get a list or array of all the states in the data set. **

In [30]:
# CODE HERE
df['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** What are the top 5 states with the most failed banks? **

In [37]:
# CODE HERE
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
...,...,...,...,...,...,...,...
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

In [ ]:
df.

In [51]:
df['ST'].value_counts()

GA    93
FL    75
IL    67
CA    41
MN    23
WA    19
MO    16
AZ    16
MI    14
NV    12
TX    12
WI    11
PA    10
CO    10
MD    10
SC    10
KS     9
OH     8
UT     8
NJ     7
TN     7
OK     7
AL     7
NC     7
OR     6
NY     5
VA     5
LA     4
PR     4
NE     3
NM     3
IN     3
AR     3
KY     2
CT     2
ID     2
MS     2
IA     2
NH     1
MA     1
WY     1
WV     1
SD     1
HI     1
Name: ST, dtype: int64

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** What are the top 5 acquiring institutions? **

In [ ]:
# CODE HERE

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [54]:
# CODE HERE
df[df['Acquiring Institution'] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [71]:
# CODE HERE
# CODE HERE
df[df['ST'] == 'CA'].value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [72]:
df.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [74]:
df['City'].value_counts()

Chicago        18
Atlanta        10
Phoenix         6
Naples          5
Scottsdale      4
               ..
Danville        1
Albuquerque     1
Ailey           1
Temecula        1
Moline          1
Name: City, Length: 424, dtype: int64

In [98]:
df[df['ST'] == 'CA'].groupby('City').min()

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Bakersfield,San Joaquin Bank,CA,23266,Citizens Business Bank,16-Oct-09,22-Aug-12
Calabasas,First Bank of Beverly Hills,CA,32069,No Acquirer,24-Apr-09,4-Sep-12
Chico,Butte Community Bank,CA,33219,"Rabobank, N.A.",20-Aug-10,12-Sep-12
Culver City,Alliance Bank,CA,23124,California Bank & Trust,6-Feb-09,16-Aug-12
Granite Bay,"Granite Community Bank, NA",CA,57315,Tri Counties Bank,28-May-10,14-Sep-12
Irvine,MetroPacific Bank,CA,57893,Sunwest Bank,26-Jun-09,5-Feb-15
La Jolla,Imperial Capital Bank,CA,26348,City National Bank,18-Dec-09,24-Aug-12
Los Angeles,California National Bank,CA,23011,First-Citizens Bank & Trust Company,26-Jun-09,20-Aug-12
Merced,County Bank,CA,22574,Westamerica Bank,6-Feb-09,4-Sep-12
Napa,Charter Oak Bank,CA,57855,Bank of Marin,18-Feb-11,12-Sep-12
Nevada City,Citizens Bank of Northern California,CA,33983,Tri Counties Bank,23-Sep-11,9-Oct-12
Newport Beach,Downey Savings & Loan,CA,30968,Mutual of Omaha Bank,21-Nov-08,12-Sep-16
Oakland,Innovative Bank,CA,23876,Center Bank,16-Apr-10,23-Aug-12
Palm Desert,"Frontier Bank, FSB D/B/A El Paseo Bank",CA,23632,"Bank of Southern California, N.A.",27-Apr-12,10-Nov-16
Palm Springs,Canyon National Bank,CA,34692,Pacific Premier Bank,11-Feb-11,19-Aug-14
Pasadena,IndyMac Bank,CA,29730,"OneWest Bank, FSB",11-Jul-08,22-Apr-15
Pomona,PFF Bank & Trust,CA,28344,"U.S. Bank, N.A.",21-Nov-08,4-Jan-13
Rancho Cucamonga,Vineyard Bank,CA,23556,California Bank & Trust,17-Jul-09,20-Aug-12
Redlands,1st Centennial Bank,CA,33025,First California Bank,23-Jan-09,13-Apr-16
San Clemente,Pacific Coast National Bank,CA,57914,Sunwest Bank,13-Nov-09,10-Apr-17
San Diego,1st Pacific Bank of California,CA,23594,City National Bank,30-Oct-09,13-Dec-12
San Francisco,Pacific National Bank,CA,30006,East West Bank,30-Oct-09,22-Aug-12
San Luis Obispo,"San Luis Trust Bank, FSB",CA,34783,First California Bank,18-Feb-11,12-Sep-16
San Rafael,Tamalpais Bank,CA,33493,"Union Bank, N.A.",16-Apr-10,23-Aug-12
Santa Monica,"First Federal Bank of California, F.S.B.",CA,28536,"OneWest Bank, FSB",18-Dec-09,23-Aug-12
Solvang,Los Padres Bank,CA,32165,Pacific Western Bank,20-Aug-10,12-Sep-12
Sonoma,Sonoma Valley Bank,CA,27259,Westamerica Bank,20-Aug-10,12-Sep-12
Stockton,Pacific State Bank,CA,27090,"Rabobank, N.A.",20-Aug-10,12-Sep-12
Temecula,Temecula Valley Bank,CA,34341,First-Citizens Bank & Trust Company,17-Jul-09,20-Oct-16
Torrance,Southern Pacific Bank,CA,27094,Beal Bank,7-Feb-03,20-Oct-08
Ventura,Affinity Bank,CA,27197,Pacific Western Bank,28-Aug-09,21-Aug-12
Westminster,First Vietnamese American Bank,CA,57885,Grandpoint Bank,5-Nov-10,12-Sep-12
Woodland Hills,Western Commercial Bank,CA,58087,First California Bank,5-Nov-10,12-Sep-16

In [ ]:
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name',ascending=False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

** How many failed banks don't have the word "Bank" in their name? **

In [99]:
# CODE HERE
df['Bank Name']

0                                    Fayette County Bank
1      Guaranty Bank, (d/b/a BestBank in Georgia & Mi...
2                                         First NBC Bank
3                                          Proficio Bank
4                          Seaway Bank and Trust Company
                             ...
546                                   Superior Bank, FSB
547                                  Malta National Bank
548                      First Alliance Bank & Trust Co.
549                    National State Bank of Metropolis
550                                     Bank of Honolulu
Name: Bank Name, Length: 551, dtype: object

In [138]:
sum(df['Bank Name'].apply(lambda x: x.lower().find('bank') == False))

28

In [134]:
df['Bank Name'].apply(lambda x: x.lower().find('bank') == False)

0      False
1      False
2      False
3      False
4      False
       ...
546    False
547    False
548    False
549    False
550     True
Name: Bank Name, Length: 551, dtype: bool

In [140]:
# banks['Bank Name'].apply(lambda name: 'Bank' not in name).value_counts()
sum(df['Bank Name'].apply(lambda name: 'Bank' not in name))

14

14

** How many bank names start with the letter 's' ? **

In [145]:
# CODE HERE
sum(df['Bank Name'].apply(lambda row: row.lower()[0] == 's'))

53

53

** How many CERT values are above 20000 ? **

In [147]:
# CODE HERE
sum(df['CERT'].apply(lambda val: val >20000))

417

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [153]:
# CODE HERE
sum(df['Bank Name'].apply(lambda val: len(val.strip().split(' ')) == 2))

114

In [152]:
' 1 2 '.strip()

'1 2'

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [ ]:
# CODE HERE

25

# GREAT JOB!